In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('credit_data.csv')

In [4]:
df.head(10)

   clientid        income        age         loan  default
0         1  66155.925095  59.017015  8106.532131        0
1         2  34415.153966  48.117153  6564.745018        0
2         3  57317.170063  63.108049  8020.953296        0
3         4  42709.534201  45.751972  6103.642260        0
4         5  66952.688845  18.584336  8770.099235        1
5         6  24904.064140  57.471607    15.498598        0
6         7  48430.359613  26.809132  5722.581981        0
7         8  24500.141984  32.897548  2971.003310        1
8         9  40654.892537  55.496853  4755.825280        0
9        10  25075.872771  39.776378  1409.230371        0

In [5]:
df.tail(10)

      clientid        income        age         loan  default
1990      1991  34237.575419  34.101654  2658.090632        0
1991      1992  26300.446554  45.539385  2317.393678        0
1992      1993  30803.806165  23.250084   623.024153        0
1993      1994  54421.410155  26.821928  3273.631823        0
1994      1995  24254.700791  37.751622  2225.284643        0
1995      1996  59221.044874  48.518179  1926.729397        0
1996      1997  69516.127573  23.162104  3503.176156        0
1997      1998  44311.449262  28.017167  5522.786693        1
1998      1999  43756.056605  63.971796  1622.722598        0
1999      2000  69436.579552  56.152617  7378.833599        0

In [6]:
df.loc[df['age'] < 0]

    clientid        income        age         loan  default
15        16  50501.726689 -28.218361  3977.287432        0
21        22  32197.620701 -52.423280  4244.057136        0
26        27  63287.038908 -36.496976  9595.286289        0

In [7]:
df2 = df.drop('age', axis=1)
display(df2)

      clientid        income         loan  default
0            1  66155.925095  8106.532131        0
1            2  34415.153966  6564.745018        0
2            3  57317.170063  8020.953296        0
3            4  42709.534201  6103.642260        0
4            5  66952.688845  8770.099235        1
...        ...           ...          ...      ...
1995      1996  59221.044874  1926.729397        0
1996      1997  69516.127573  3503.176156        0
1997      1998  44311.449262  5522.786693        1
1998      1999  43756.056605  1622.722598        0
1999      2000  69436.579552  7378.833599        0

[2000 rows x 4 columns]

In [8]:
df3 = df.drop(df[df['age'] < 0].index)
display(df3)

      clientid        income        age         loan  default
0            1  66155.925095  59.017015  8106.532131        0
1            2  34415.153966  48.117153  6564.745018        0
2            3  57317.170063  63.108049  8020.953296        0
3            4  42709.534201  45.751972  6103.642260        0
4            5  66952.688845  18.584336  8770.099235        1
...        ...           ...        ...          ...      ...
1995      1996  59221.044874  48.518179  1926.729397        0
1996      1997  69516.127573  23.162104  3503.176156        0
1997      1998  44311.449262  28.017167  5522.786693        1
1998      1999  43756.056605  63.971796  1622.722598        0
1999      2000  69436.579552  56.152617  7378.833599        0

[1997 rows x 5 columns]

In [9]:
df.mean()

clientid     1000.500000
income      45331.600018
age            40.807559
loan         4444.369695
default         0.141500
dtype: float64

In [10]:
df['age'].mean() # media com idades negativas

40.80755937840458

In [11]:
df['age'][df['age'] > 0].mean() # media com idades positivas

40.92770044906149

In [12]:
df.loc[df['age'] < 0, 'age'] = 40.92

In [13]:
df.loc[df['age'] < 0]

Empty DataFrame
Columns: [clientid, income, age, loan, default]
Index: []

Tratamento de valores missing

In [14]:
df.isnull()

      clientid  income    age   loan  default
0        False   False  False  False    False
1        False   False  False  False    False
2        False   False  False  False    False
3        False   False  False  False    False
4        False   False  False  False    False
...        ...     ...    ...    ...      ...
1995     False   False  False  False    False
1996     False   False  False  False    False
1997     False   False  False  False    False
1998     False   False  False  False    False
1999     False   False  False  False    False

[2000 rows x 5 columns]

In [15]:
df.isnull().sum()

clientid    0
income      0
age         3
loan        0
default     0
dtype: int64

In [16]:
df.loc[pd.isnull(df['age'])]

    clientid        income  age         loan  default
28        29  59417.805406  NaN  2082.625938        0
30        31  48528.852796  NaN  6155.784670        0
31        32  23526.302555  NaN  2862.010139        0

In [18]:
df['age'].fillna(df['age'].mean(), inplace=True)

In [19]:
df.loc[pd.isnull(df['age'])]

Empty DataFrame
Columns: [clientid, income, age, loan, default]
Index: []

In [22]:
df.loc[df['clientid'].isin([29, 31, 32])]

    clientid        income        age         loan  default
28        29  59417.805406  40.927689  2082.625938        0
30        31  48528.852796  40.927689  6155.784670        0
31        32  23526.302555  40.927689  2862.010139        0

In [27]:
x_credito = df.iloc[:, 1:4].values

In [28]:
x_credito

array([[6.61559251e+04, 5.90170151e+01, 8.10653213e+03],
       [3.44151540e+04, 4.81171531e+01, 6.56474502e+03],
       [5.73171701e+04, 6.31080495e+01, 8.02095330e+03],
       ...,
       [4.43114493e+04, 2.80171669e+01, 5.52278669e+03],
       [4.37560566e+04, 6.39717958e+01, 1.62272260e+03],
       [6.94365796e+04, 5.61526170e+01, 7.37883360e+03]])

In [29]:
type(x_credito)

numpy.ndarray

In [30]:
y_credito = df.iloc[:, 4].values

In [31]:
y_credito

array([0, 0, 0, ..., 1, 0, 0], dtype=int64)

In [32]:
type(y_credito)

numpy.ndarray

In [33]:
x_credito[:, 0].min() # menor renda

20014.4894700497

In [34]:
x_credito[:, 0].max() # maior renda

69995.6855783239

In [35]:
x_credito[:, 0].min(), x_credito[:, 1].min()

(20014.4894700497, 18.055188510566897)

In [36]:
x_credito[:, 0].max(), x_credito[:, 1]. max()

(69995.6855783239, 63.971795841120205)

In [37]:
from sklearn.preprocessing import StandardScaler

In [38]:
scaler_credito = StandardScaler()

In [39]:
x_credito = scaler_credito.fit_transform(x_credito)

In [40]:
x_credito[:, 0].min(), x_credito[:, 1].min(), x_credito[:, 2].min()

(-1.7676158019964077, -1.7264145408889917, -1.4592791099462408)

In [41]:
from sklearn.model_selection import train_test_split

In [42]:
x_creditoTreino, x_creditoTeste, y_creditoTreino, y_creditoTeste = train_test_split(x_credito, y_credito, test_size=0.25, random_state=1)

In [43]:
x_creditoTreino.shape

(1500, 3)

In [44]:
y_creditoTreino.shape

(1500,)

In [45]:
x_creditoTeste.shape

(500, 3)

In [46]:
y_creditoTeste.shape

(500,)

In [47]:
import pickle

In [48]:
with open('credito.pkl', mode='wb') as file:
    pickle.dump([x_creditoTreino, y_creditoTreino, x_creditoTeste, y_creditoTeste], file)